In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [21]:
import pandas as pd

In [5]:
data = [1,2,3,4,5,6]
data

[1, 2, 3, 4, 5, 6]

In [6]:
type(data)

list

In [12]:
#create a series from the list
s= pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [8]:
type(s)

pandas.core.series.Series

In [13]:
df=pd.DataFrame(s,columns=['num'])
df

   num
0    1
1    2
2    3
3    4
4    5
5    6

In [14]:
data=[[1,2],[3,4],[5,6]]
data

[[1, 2], [3, 4], [5, 6]]

In [16]:
s=pd.Series(data)
s

0    [1, 2]
1    [3, 4]
2    [5, 6]
dtype: object

In [18]:
df=pd.DataFrame(data,columns=['data1','data2'])
df

   data1  data2
0      1      2
1      3      4
2      5      6

In [23]:
s=pd.read_excel('test.xlsx')
s

   id    name
0  12  rabita
1  41   israt
2  63  marzia